{
  "Outside Bar":{
    "NPC":["biker"],
    "items": ["pool cue", "eight ball", "boots"],
    "enemies": ["bouncer"],
    "bosses": [""],
    "name": ["Outside Bar"],
    "east": ["Inside Bar"],
    "Description": ["With a amalgam of money, power, and corruption in this city..  so many gather at this bar before enjoying the rest of the Casino.  At the back entrance outside the bar lays a solitary door guarded by three bouncers.  'Three guys at the door and some drunk...maybe I can get in with no trouble'", "room change 1", "room change 2"]
  },
  "Inside Bar":{
    "NPC":["friendly bartender"],
    "items": ["pool cue", "eight ball", "boots with a fur", "watch"],
    "enemies": ["security guard"],
    "bosses": [""],
    "name": ["Inside Bar"],
    "south": ["Pool Room"],
    "west": ["Outside Bar"],
    "Description": ["Inside you can smell the money on these folks as much as you can smell the expensive drinks that mostly seemed to make it to the floor rather than their mouths.  The cities affluent and elite stumbling around in drunken stupor 'Loose lips can reveal great information, even more when alcohol did the loosening'", "room change 1", "room change 2"]
  },
  "Pool Room":{
    "NPC":["pool player"],
    "items": ["eight ball", "boots"],
    "enemies": ["pool shark"],
    "bosses": [""],
    "name": ["Pool Room"],
    "east": ["Alley Behind Bar"],
    "north": ["Inside Bar"],
    "Description": ["Filled with fake tans and airheads, a massive pool filled with the cities elite socialites.  On the side, staged a uncountable amount of lounge chairs as waiters scurried around to fill the drinks of their customers", "room change 1", "room change 2"]
  },
  "Alley Behind Bar":{
    "NPC":["beggar"],
    "items": ["boots"],
    "enemies": [],
    "bosses": ["bartender"],
    "name": ["Alley Behind Bar"],
    "east": ["Locker Room"],
    "west": ["Pool Room"],
    "Description": ["Rows of bikes and rows of bikers besides them.  Within the middle of them all is none other than the Bartender himself.  According to the Security guard, The Bartender mixes the drinks to the cities most scummiest, nothing gets by without his knowing.  If anyone would know where to look for this kid, he would know", "room change 1", "room change 2"]
  },
  "Locker Room":{
    "NPC":["guy in towel"],
    "items": ["towel"],
    "enemies": ["locker guard"],
    "bosses": [""],
    "name": ["Locker Room"],
    "east": ["Pool Deck"],
    "south": ["Pool Bar"],
    "west": ["Alley Behind Bar"],
    "Description": ["Lockers far as the eyes can see with benches to accommodate the patrons that come to enjoy the Pools and spas of the Megaland Casino and resort.  The steam wafting from the sauna as people of power speak their business and dealings in the underworld environment of this city.  'The kid was held here until someone came to collect them, there has to be some sort of clue into where they took them next' said Jemad.", "room change 1", "room change 2"]
  },
  "Pool Deck":{
    "NPC":["bartender"],
    "items": ["water bottle"],
    "enemies": ["pool boy"],
    "bosses": [""],
    "name": ["Pool Deck"],
    "west": ["Locker Room"],
    "south": ["Pool Deck: Upper Level"],
    "shortcut": ["Pool Bar"],
    "Description": ["Filled with fake tans and airheads, a massive pool filled with the cities elite socialites.  On the side, staged a uncountable amount of lounge chairs as waiters scurried around to fill the drinks of their customers.  'According to the old man... the kid was passed off that the head life guard to be taken to the upper deck.  How do I get to the upper deck?'", "room change 1", "room change 2"]
  },
  "Pool Bar":{
    "NPC":["bartender"],
    "items": ["dirty plate"],
    "enemies": ["dishwasher"],
    "bosses": [""],
    "name": ["Pool Bar"],
    "east": ["Pool Deck: Upper Level"],
    "shortcut": ["Pool Deck"],
    "north":["Locker Room"],
    "Description": ["Drinks as colorful as the bathing suits of the swimmers guzzling them down.  The Pool bar stretched almost as long as the length of the pool.  According to the life guard, the kid was held with the bar manager until they were ready to take them inside,  where did they take the kid after is the question? And who is the bar manager?", "room change 1", "room change 2"]
  },
  "Pool Deck: Upper Level":{
    "NPC":["bartender"],
    "items": ["empty bottle"],
    "enemies": [""],
    "bosses": ["big ben"],
    "name": ["Pool Deck: Upper Level"],
    "south": ["Slot Machines"],
    "west": ["Pool Bar"],
    "north":["Pool Deck"],
    "Description": ["Jemad never before seen architecture built around a pool to make it look like a natural waterfall indoors.  Few people moved around this floor as the bar manager explained as it is reserved only for the inner circle of the cities elite.  'This is where the bar manager told me I can find this Big Ben guy'  Jemad says as he scans the area to find his target", "room change 1", "room change 2"]
  },
  "Slot Machines":{
    "NPC":["smoker"],
    "items": ["cigarette butt"],
    "enemies": ["slots guard"],
    "bosses": [""],
    "name": ["Slot Machines"],
    "east": ["Poker Tables"],
    "south": ["Steak House"],
    "north": ["Pool Deck: Upper Level"],
    "Description": ["A barrage of dings and whistles roared across the floor as hundreads if not thousands of slot machines ready to swindle the money out of people pockets.  'Big Ben said that the kid was taking here for the Pit Boss in order to be taken to the hotel suite,  I have to get the key from him in order to get to the top floor'", "room change 1", "room change 2"]
  },
  "Poker Tables":{
    "NPC":["dealer"],
    "items": ["playing cards"],
    "enemies": ["pit guard"],
    "bosses": [""],
    "name": ["Poker Tables"],
    "west": ["Slot Machines"],
    "south": ["VIP Room"],
    "Description": ["High stake bets is all that is welcomed at these poker tables.  Tables filled with mountains of poker chips that ranged in not only the thousands but millions.  Jemad scanned the area and picked out a table that had only a few people seated.", "room change 1", "room change 2"]
  },
  "Steak House":{
    "NPC":["waiter"],
    "items": ["steak knife"],
    "enemies": ["chef"],
    "bosses": [""],
    "name": ["Steak House"],
    "east": ["VIP Room"],
    "north": ["Slot Machines"],
    "Description": ["When the poker dealer told me the pit boss was eating at the Steak house, Jemad thought a classic road side greasy dirt hole.  What was here was a 5 star restaurant where people drowned their frustrations in mountains of food", "room change 1", "room change 2"]
  },
  "VIP Room":{
    "NPC":[""],
    "items": ["cash"],
    "enemies": [""],
    "bosses": ["pit boss"],
    "name": ["VIP Room"],
    "east": ["Elevator"],
    "north": ["Poker Tables"],
    "west": ["Steak House"],
    "Description": ["If ever there was a VIP area to cater to a select people, Jemad was standing in one.  High end chairs looking good enough to fall asleep in, waiters standing by to wait on every whim of the players.  In the middle, a solitary table with just six seats for the highest of rollers the city has to offer.  At the table, only 1 seat was filled by who Jemad could only assume was the Pit Boss", "room change 1", "room change 2"]
  },
  "Elevator":{
    "NPC":["attendant"],
    "items": [""],
    "enemies": ["elevator man"],
    "bosses": [""],
    "name": ["Elevator"],
    "east": ["Hotel Halls"],
    "west": ["VIP Room"],
    "Description": ["To call this a elevator would be a understatement.  This elevator is so massive that it could fit a whole marching band.  Jemad slides the key card he got off the Pit Boss into the slot and selects the hotel lobby.  'Jeez, you need a VIP card just to even see the lobby?'  The Elevator starts to slow move as the numbers on the dial increases", "room change 1", "room change 2"]
  },
  "Hotel Halls":{
    "NPC":["receptionist"],
    "items": ["pamphlet"],
    "enemies": ["hall guard"],
    "bosses": [""],
    "name": ["Hotel Halls"],
    "south": ["Balcony"],
    "west": ["Elevator"],
    "Description": ["Ostrich feather wall paper and marble floors is what graced the patrons lucky enough to set foot into the Hotel suites.  At the very end of the lobby stood the concierge behind a chest high desk.  With eyes glued on Jemad as he walked up, it seems he has been waiting for him ", "room change 1", "room change 2"]
  },
  "Balcony":{
    "NPC":["cleaner"],
    "items": ["plant"],
    "enemies": ["ninja"],
    "bosses": [""],
    "name": ["Balcony"],
    "east": ["Rooftop: Final Boss"],
    "north": ["Hotel Halls"],
    "Description": ["The Balconies at the Hotels were wide enough to have a party on it alone, and the rooms could fit a small family by itself.  Thousands of feet off the ground, the balcony over looked hundreads of buildings into the city", "room change 1", "room change 2"]
  },
  "Rooftop: Final Boss":{
    "NPC":[""],
    "items": [""],
    "enemies": ["Don Fury"],
    "bosses": [""],
    "name": ["Rooftop: Final Boss"],
    "west": ["Balcony"],
    "Description": ["'At Last' Jemad thought to himself as he finally made it to the Roof top suite balcony.  Inside he could see a office with a large solid wood desk and 2 figures standing near it.  One figure was tall and solid, the other about waist high to Jemad.  'Must be the kid but who are they with?' Jemad walks inside to finally bring this madness to a close", "room change 1", "room change 2"]
  }
}