{
  "Game Intro":{
    "Intro": ["Jemad is a ex-FBI agent, that has bowed out the service but utilizes his skills learned there as a now private investigator for missing persons cases.  Taking a case involving an abducted child who has been thought to be dead,  Jemad uncovers a story that is not quite what it seems on the surface.  With a break in clues and a lead on where the child is being held,  Jemad arrives at the MegaLand Casino and Resort.  The madness of Jemad objective is to follow the trail of clues and rescue the child."]
  },
  "Bar":{
    "Outside Bar":{
      "Outside Bar scene":["With a amalgam of money, power, and corruption in this city..  so many gather at this bar before enjoying the rest of the Casino.  At the back entrance outside the bar lays a solitary door guarded by three bouncers.  'Three guys at the door and some drunk...maybe I can get in with no trouble'"],
      "Intro1":"With a thunderous crack of a bat, the bouncer levels a drunken patron and motions the others to dispose of him",
      "Intro2":"'Hey!' Jemad screams, 'Is that how I am looking forward to be treated for just wanting a drink?'",
      "Intro3": "'..and who is the smart ass wanting to be next?' said the bouncer. 'Wait a minute...I have seen your face before somewhere..'",
      "Combat intro bar":"The Bouncer recognizes him from the warning pictures posted from the higher ups.  He quickly straightens up and rushes to attack...get ready",
      "Combat outro bar":"'Guess he was not as tough as he thought.. now to take a look inside the bar and see what clues I can find out'"
    },
    "Inside bar": {
      "Inside bar scene":["Inside you can smell the money on these folks as much as you can smell the expensive drinks that mostly seemed to make it to the floor rather than their mouths.  The cities affluent and elite stumbling around in drunken stupor 'Loose lips can reveal great information, even more when alcohol did the loosening'"],
      "Intro1":"'Is there some sort of celebration tonight?' Jemad asked a lavishly dressed gentleman.  'Get me another drink waiter, my glass is looking empty' he then throws the glass at Jemad",
      "Intro2":"'Just need some information on this child here and ill be on my way to get you that drink..'  Jemad pulls a photo out and shows it to the man.  'Is this the kind of service that is provided to us here?!? SECURITY'  slapping Jemad hand away with the photo",
      "Intro3":"Jemad can see from the corner of the room a Security Guard running up to see what the commotion is about 'Get this poor excuse for a waiter out my sight'",
      "Combat intro bar":"The security guard moves to grab Jemad by the arm...",
      "Combat outro bar":"With a loud thud, the security guard drops like a stone 'Now to go find that guy and get my information'",
      "Inside bar outro":"'Sorry our conversation was interrupted'  Jemad went back to the drunk gentleman and grabbed him by the collar and squeezed all the information out of him"
    },

    "Pool Room":{
      "Pool Room scene":["Covered in a thinly veiled sea of smoke and in that sea, nothing but seedy pool sharks and hustlers.  Rows of pool tables with players getting duped after drinking and thinking they could beat one of these sharks.  The Pool room is where I can find the information I want from word of mouth"],
      "Intro1":"'Hey, I am looking for some information on a missing kid'  Jemad says being being cut off by a semi sober player  'And I am looking for some information to beat this swindler!!'",
      "Intro2":"Jemad looks across the table and sees a well dressed guy across with a grin.  'There goes a guy who looks like he knows what I am looking for' Jemad walks over to the Con man",
      "Intro3":"'Lost my kid and someone told me you're the guy to speak to on where to find them?'  The look on the Con man's face turns sour 'Sure, my friend here will answer all the questions you have' He motions for a bigger Pool Shark to get rid of Jemad",
      "Combat intro Pool Room":"'Hey old man, I am going to need you to come with me, you are cramping the mood'  He runs over to Jemad and throws a kick,  Jemad quickly dodges to the side and gets ready to take care of this guy",
      "Combat outro Pool Room":"The Pool Shark lies crumpled against a pool table from the last blow  'Now as we were talking about'  Jemad cracks his knuckles and walks up to the Pool shark.  The Con man tries to run but is stopped when as Jemad grapped him at the collar and started to question him on the missing kid"
    },
    "Alley Behind Bar":{
      "Bar alley scene":["Rows of bikes and rows of bikers besides them. Within the middle of them all is none other than the Bartender himself.  According to the Security guard, The Bartender mixes the drinks to the cities most scummiest, nothing gets by without his knowing.  If anyone would know where to look for this kid, he would know"],
      "Intro1":"'I see you got the boys back together, Is this the rehearsal for your comeback album?'  Jemad says as a row of helmeted bikers turned to look at him",
      "Intro2":"'We heard there was a smart mouth rat scurrying around my bar asking to many questions' The Bartender spat",
      "Intro3":"'You think you are going to get information on the kid through me? Seems like you took a few shots and lost your damn mind in my bar.  You dont even know what you are really doing here.' said the Bartender'  Would it help if I bought you a drink to loosen your lips, rather than loosening your jaw with my fist?' quipped Jemad.",
      "Combat intro Bar alley":"'You should have brought a army to do this dirty work' said the Bar Tender as he takes off his jacket to reveal muscles honed for fighting.  He rushes to Jemad and gets ready to attack",
      "Combat outro Bar alley":"'Heh, aint no butler around here, I take the trash out myself' Jemad says as he pulls out a note from the Bartender tossed jacket,  written on it  'Keep the kid in the pool house until I come from the game floor' looks like it's time to go for a dip at the pool"
    }
  },
  "Pool & Cabanas":{
    "Locker Room":{
      "Locker Room scene":["Lockers far as the eyes can see with benches to accommodate the patrons that come to enjoy the Pools and spas of the Megaland Casino and resort.  The steam wafting from the sauna as people of power speak their business and dealings in the underworld environment of this city.  'The kid was held here until someone came to collect them, there has to be some sort of clue into where they took them next' said Jemad."],
      "Intro1":"'Hey! you are not supposed to be in here looking around our things! Security!  Where is the Security here!' Screamed the old man wrapped in a a small towel.",
      "Intro2":"Jeez, well there goes my eyesight and in advance, thank you for the nightmares I will have of your small towel.  'Looking for a kid that was held here about a week ago,  you wouldn't know anything about that would you?'",
      "Intro3":"'Security! get this thief out of here! and make sure he will not be able to walk back here as well,  I dont like the questions he is asking...'",
      "Combat intro Locker Room":"As the Locker Guard rushes to Jemad,  the old man moves out of the way and heads towards the lockers to get dressed.  'Hey! where you going? we didnt finish our conversation! Jemad yelled as he got ready to deal with the hired muscles'",
      "Combat outro locker Room":"'Lay there and enjoy this steam, it is really good on the pores.' Said Jemad as there Locker Guard laid there unconscious.  'Jeez man you are still out here assaulting people vision with that tiny towel?  Before I go blind, lets talk about how much you know and what I am looking for, and be quick about it!'"
    },
    "Pool Deck":{
      "Pool Room scene":["Filled with fake tans and airheads, a massive pool filled with the cities elite socialites.  On the side, staged a uncountable amount of lounge chairs as waiters scurried around to fill the drinks of their customers.  'According to the old man... the kid was passed off that the head life guard to be taken to the upper deck. How do I get to the upper deck?'"],
      "Intro1":"Located at the head of the deep end on a lavishly tall watch tower sat what Jemad imagined to be the head life guard  'Looks like the information will pay off'",
      "Intro2":"Jemad approaches the head life guard and can see that he notices him as he walks up 'Dont look like you are dressed for this pool party,  are you sure you are at the right place old man?'",
      "Intro3":"'Lost my kid and someone told me you're the guy to speak to on where to find them?'  The look on the lifeguards face turns sour 'Sure, my pool boy here will answer all the questions you have'  He motions for the pool boy to get rid of Jemad",
      "Combat intro Pool Room":"'Hey old man, I am going to need you to come with me, you are cramping the mood'  He runs over to Jemad and throws a kick,  Jemad quickly dodges to the side and gets ready to take care of this guy",
      "Combat outro Pool Room":"The pool boy lies crumpled against a lounge chair from the last blow  'Now as we were talking about' Jemad cracks his knuckles and walks up to the lifeguard.  The lifeguard tries to run but is stopped when as Jemad grabbed at his whistle and started to question him on the missing kid.  'How do I join the elite sun tan club and get to the upper decks?'"
    },
    "Pool Bar":{
      "Pool bar scene":["Drinks as colorful as the bathing suits of the swimmers guzzling them down.  The Pool bar stretched almost as long as the length of the pool.  According to the life guard, the kid was held with the bar manager until they were ready to take them inside, where did they take the kid after is the question?  And who is the bar manager?"],
      "Intro1":"'Hey, where can I find the bar manager' Jemad yells as a waiter runs by.  'You can find him over there at the end of the bar,  he is the gentleman in the blue suit' the waiter points to the corner where this slick looking gentleman in a blue suit stood with an air of authority.",
      "Intro2":"The bar manager stood with his nose up and his gaze down as he watched his waiters run back and forth between the lounge chairs and stand up tables.  'And who are you?' as his gaze fell upon Jemad.  'You know you should really look into providing your guest at the sauna with bigger towels,  it was not pretty in there' said Jemad.  'Ahhh... so you are him, we got word of someone on mission thinking they are doing the right thing, oh how little you know' spat the bar manager",
      "Intro3":"'This way to what you are looking for, we must speak where there is no eyes' said the bar manager.  In the kitchen behind the bar was a massive kitchen.  'Here is the answer you are seeking, please be quick of disposing him' said the bar manager to a massive dishwasher.",
      "Combat intro Pool bar":"'Why cant this ever be easy?' Jemad said as he cracked his knuckles.  The muscled dishwasher tosses aside of glasses with a crunch and runs towards Jemad ready to battle",
      "Combat outro Pool bar":"'Man, I hope they dont get any bigger than you from here on out' said Jemad  'You! oh ima enjoy this one, where is kid!'  Jemad walks up to the bar manager and hits him in the face to let him know he meant business.  They had a good and long conversation"
    },
    "Pool Deck Upper Level":{
      "Pool Deck Upper Level scene":["Jemad never before seen architecture built around a pool to make it look like a natural waterfall indoors.  Few people moved around this floor as the bar manager explained as it is reserved only for the inner circle of the cities elite.  'This is where the bar manager told me I can find this Big Ben guy' Jemad says as he scans the area to find his target"],
      "Intro1":"'Hey, where is your boss Big Ben?' Asked Jemad to a hired muscle.  'Why are you looking for the boss?' countered the muscle? 'I was told by the bar manager to pass on a message concerning the guy looking for the kid' said Jemad.  'Oh ok, right this way he is over here' and the muscle motioned for Jemad to follow him",
      "Intro2":"As they walked up to a makeshift hut with lavish curtains and furniture, inside sat a man that could only be for certain Big Ben.  Big aint the word for this asshole, and from the discolored and scarred knuckles, Jemad observed.",
      "Intro3":"'Mr. Jemad, I have been waiting for you' Said Big Ben.  'The hero, looking to free the child from the grasp of evil huh? Did you ever think to ask why the kid is here with us? heh' laughed Big Ben 'You gonna lecture me all day or tell me what I need to know? If I see one more speedo, I think I will literally go blind.  Where's the kid Paul Bunyan.'",
      "Combat intro Pool Deck Upper level":"'There is the smart mouth we have heard about since you came into the bar, dont worry...  I'll shut that mouth once and for all' As Big Ben stood up and walked towards Jemad with a menacing smile",
      "Combat outro Pool Deck Upper level":"Breathing heavy, Jemad gets to one knee looking over the felled goliath.'  ...And stay down' Jemad said with a chuckle.  'You are going to give me all the information you know concerning this kid'"
    }
  },
  "Casino Floor":{
    "Slot Machines":{
      "Slot Machines scene":["A barrage of dings and whistles roared across the floor as hundreads if not thousands of slot machines ready to swindle the money out of people pockets.  'Big Ben said that the kid was taking here for the Pit Boss in order to be taken to the hotel suite,  I have to get the key from him in order to get to the top floor'"],
      "Intro1":"As Jemad walked through the rows of Slot Machines looking for a area where he could inquire where the Pit boss location was.  As he walked for a few minutes he could see from the corner of his eyes that security was starting to follow him and keep his distance",
      "Intro2":"Jemad thought to himself? 'How can I find this Pit Boss' just as quickly as he thought it, an idea popped into his head",
      "Intro3":"Jemad runs and launches a heavy kick at a near by Slot machine causing it to start spewing thousands and thousands of coins onto the ground.  All casino players started to run and scramble in order to grab the money for themselves",
      "Combat intro Slot Machines":"The Slots guard runs up to Jemad fist clenched.  'You boys finally here to show me around?'",
      "Combat outro Slot Machines":"As the security guard laid on the ground only held up by Jemad grasp of his collar 'Now which way to the Pit Boss, I dont have all day' said Jemad.  The Security points towards the poker tables as the next stop"
    },
    "Poker Tables":{
      "Poker Table Scene":["High stake bets is all that is welcomed at these poker tables. Tables filled with mountains of poker chips that ranged in not only the thousands but millions.  Jemad scanned the area and picked out a table that had only a few people seated."],
      "Intro1":"'Welcome sir, you picked the finest table to win big!' smiled the poker dealer.",
      "Intro2":"'How much chips will you like to wager?' As he motioned for Jemad to lay them on the table.  Jemad fished in his pocket and found a chip he took off a security guard at the slot machines",
      "Intro3":"'I have a whole 5 bucks to spend and ready to win big!' Jemad said with a smirk.  'Ahhh... well since you are such a high roller, we have a special seat for you sir' and with that the poker dealer snapped his fingers and nodded towards Jemad",
      "Combat Intro Poker Table":"A bouncer walks up to Jemad and grabs him by his arm, 'Come with me sir..'  and with a sharp yank he lifts Jemad out of the chair.  Seems like I cant catch a break as Jemad shoved the bouncer back",
      "Combat outro Poker Table":"As the Pit guard falls to the floor with a loud thud, Jemad fixes his jacket and turns to the poker dealer.  'I wont make you eat this chip if you tell me what I need to know, where is your Pit boss..'"
    },
    "Steak House":{
      "Steak House scene":["When the poker dealer told me the pit boss was eatting at the Steak house, Jemad thought a classic road side greasy dirt hole.  What was here was a 5 star restaurant where people drowned their frustrations in mountains of food"],
      "Intro1":"'I wonder how the Pit boss looks' Jemad thought. Is he even still here stuffing his face while I have been causing havoc on his casino floor?",
      "Intro2":"Eyeing all this food Jemad thought to himself, when was the last time he had eaten? It feels like this night has been far to long.",
      "Intro3":"Jemad finds his way eventually into the kitchen of the Steak house and there he see the head chef.  'Hey, just wanted to pay my compliments to the chef and sing your praises to the Pit boss, know where I can find him?'",
      "Combat intro Steak House":"The Chef turns around and looks at Jemad with beady eyes.  Grease stains all over his shirts, he runs to Jemad with Malice given him barely enough time to lift his hands in defense",
      "Combat outro Steak House":"'So what are you a mute!?' Jemad yells as he holds the Chef up by his greasy hair.  'Where can I find the Pit Boss!? and PLEASE tell me you wash your hands before you made this food!'  The cook writes on a peiece of paper only 3 letters... VIP"
    },
    "VIP Room":{
      "VIP Room Scene":["If ever there was a VIP area to cater to a select people, Jemad was standing in one.  High end chairs looking good enough to fall asleep in, waiters standing by to wait on every whim of the players.  In the middle, a solitary table with just six seats for the highest of rollers the city has to offer.  At the table, only 1 seat was filled by who Jemad could only assume was the Pit Boss"],
      "Intro1":"'The Ex Special Agent Jemad himself, you have been causing quite a stir on my floors.  It seems the P.I. business is not paying well if you only had a $5 chip to your name'",
      "Intro2":"'You go through all this trouble to save a kid, knowing only half the story...  are you really ready to go through all this for a measly paycheck from a family you dont really know?'",
      "Intro3":"'And here I thought I was coming to win big at poker not hear ya gums flapping.  Why dont you do us both a favor and tell me where the kid is?' Jemad said with a sigh.  'Ever a smart ass even when facing a uphill battle' quipped the Pit Boss",
      "Combat Intro VIP Room":"'I am a betting man, we can make a wager here...  you beat me and ill tell you exactly where to find the girl.  If I win... I throw you out the highest window on the top floor'  The Pit boss squares up and stomps towards Jemad",
      "Combat outro VIP Room":"'I see you chose to lose your teeth today but not enough that you cant tell me where the kid is?' said Jemad.  'Do you even know why we have the kid idiot!?  You are walking to your doom for a lost cause' spat the Pit Boss as blood sprayed out his mouth.  Jemad cracks his knuckles and smiles as he gets his answer...  the next location the Hotel Suite"
    }
  },
  "Hotel Suite":{
    "Elevator":{
      "Elevator scene":["To call this a elevator would be a understatement.  This elevator is so massive that it could fit a whole marching band.  Jemad slides the key card he got off the Pit Boss into the slot and selects the hotel lobby.  'Jeez, you need a VIP card just to even see the lobby?' The Elevator starts to slow move as the numbers on the dial increases"],
      "Intro1":"The Elevator stops on the 45th floor, and in walks a man that clearly is here for nothing good Jemad thought.  'Nice night for fishing huh?'Jemad stated to try and through the bouncer off guard",
      "Intro2":"The bouncer turns around with a snarl and walk up to close enough that he could smell his breath.  'Woooooooo, I see hygiene is not part of the requirement to become a hired muscle huh?'  Jemad waves his hands back and forth in front of his nose",
      "Intro3":"The bouncer got more and more agitated and grabbed Jemad by the collar.  'I am sensing a pattern here with you guys, fight first and I ask questions later is that it?'",
      "Combat intro Elevator":"The Elevator man tosses Jemad at the other end of the elevator and hits the emergency button to stop their ascent.  Looks like I cant just sit back and enjoy this ride huh? Jemad thinks as he gets ready to battle",
      "Combat outro Elevator":"As the elevator man laid on the floor unconscious, Jemad walks over to the elevator buttons and presses the hotel lobby.  'Well that was unnecessary' smirked Jemad as he looked at the bouncer laying on the floor"
    },
    "Hotel Halls":{
      "Hotel Halls scene":["Ostrich feather wall paper and marble floors is what graced the patrons lucky enough to set foot into the Hotel suites.  At the very end of the lobby stood the concierge behind a chest high desk.  With eyes glued on Jemad as he walked up, it seems he has been waiting for him "],
      "Intro1":"'How much would a room on the top floor cost for a night or two?' said Jemad.  'More than you could earn in 4 lifetimes said the concierge' with a smirk",
      "Intro2":"'I guess hospitality is not your number one priority here is it?' laughed Jemad.  The concierge snaps his fingers and out from behind the desk door jumps out a Hall Guard.",
      "Intro3":"'How many of you guys do I need to leave unconscious before you get the idea that this is not the way? Jeez' sighed Jemad.",
      "Combat intro Hotel Halls":"The Hall Guard lunges at Jemad from behind the desk but missed as Jemad simply stepped out the way.  'Not starting out good for you huh?' Jemad gets ready to take this guy out",
      "Combat outro Hotel halls":"Finishing off the Hall Guard,  Jemad quickly turns to the concierge and says  'Before you even think of calling another guard let me tell you something' Jemad breaks the concierge finger leaving him wailing"
    },
    "Balcony":{
      "Balcony scene":["The Balconies at the Hotels were wide enough to have a party on it alone, and the rooms could fit a small family by itself.  Thousands of feet off the ground, the balcony over looked hundreds of buildings into the city"],
      "Intro1":"According to the concierge, the big boss men are waiting for Jemad with weapons at the ready to take him out.  The best way to get to the rooftop apartment is by using the balcony.",
      "Intro2":"'Good thing I aint afraid of heights' Jemad says to himself as he takes a look over the side.  Just as he turns around, he barely has time to dodge a object hurtling towards his head",
      "Intro3":"As he looks up, he see's a figure cloaked all in black, eyes barely seen behind a face covering.  'Are you kidding me? A Ninja in this day and age? I always wanted to fight a ninja I guess..'",
      "Combat intro Balcony":"The ninja rushes towards Jemad ready to strike",
      "Combat outro Balcony":"'As the ninja tumbled over the edge of the balcony unto the bottom one below.  Jemad looks over the side 'I thought ninjas always landed on their feet?' he said with a smile as he continued to climb up the balcony on his way to the rooftop floor"
    },
    "Rooftop: Final Boss":{
      "Rooftop: Final Boss scene":["'At Last' Jemad thought to himself as he finally made it to the Roof top suite balcony.  Inside he could see a office with a large solid wood desk and 2 figures standing near it.  One figure was tall and solid, the other about waist high to Jemad.  'Must be the kid but who are they with?' Jemad walks inside to finally bring this madness to a close"],
      "Intro1":"'You finally made it to my humble abode, I would offer you a drink but I know you would just like to get down to business.  You were offered money to bring this child back to their family because I 'Kidnapped' them right?  What if I told you that this child belongs right where they were meant to be?'",
      "Intro2":"'Take a look for yourself Jemad, this child was not kidnapped but returned to me...  I am the child birth father' the Don Fury throws birth certificates on the floor infront of Jemad in plain sight as proof that he was duped.  A rival family taken out by Don Fury guys in a last ditch effort kidnapped his child and raised them as their own.",
      "Intro3":"'You see Jemad, you are fighting for the wrong side, the kid belongs here with me!' Jemad looks up and can see the tears in the kids face, no matter the farce Jemad still had to finish the job",
      "Combat intro Rooftop: Final Boss":"'Your fighting on the wrong side of this one Jemad' spat Don Fury, as he removed his jacket show casing that this guy was no punk.  Ripped with muscle from head to toe, the Don could handle his own. This is it Jemad, the last fight...",
      "Combat outro Rooftop: Final Boss":"Barely able to stand, Jemad has done it.  He walks over to the kid as they hid behind the desk looking at the Don unconscious body.  'Well, what am I going to do now?'  The kid was indeed the child of Don Fury, but was raised to be loved by their enemy. "
    },
    "Game Outro":{
      "outro":"After all this Madness, the only thing to do is to let the kid decide.\n\nGo back to a family that held them hostage at birth but came to love and raise them as their own, or stay with a father they know nothing about apart from sharing the same blood.\n\n The decision is not an easy one to make for someone so young.\n What would you do if in the same position Jemad?.\nAnyways, good work Jemad!."
    }
  }
}
